<template>
    <div class="messages">
        <div class="messages__content">
            <div class="messages__date">
                <input type="text" placeholder="Введите дату">
            </div>
            <div class="messages__text">
                <textarea placeholder="Введите сообщение"></textarea>
                <div class="messages__text__actions">
                    <button>Ж</button>
                    <button>Ч</button>
                    <button>I</button>
                </div>
            </div>
            <div class="messages__container">
                <div class="messages__items">
                    <div 
                        class="messages__item"
                        v-for="item in messages"
                        :key="item.id">
                        <div class="messages__item__actions">
                            <div class="messages__item__date">
                                <span>Сообщение будет отправлено:</span>
                                <b>{{item.date}}</b>
                            </div>
                            <div class="messages__item__action">
                                <i class="material-icons">more_horiz</i>
                            </div>
                        </div>
                        <div class="messages__item__data">
                            {{item.message}}
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    data(){
        return{
            messages: [
                {
                    id: 1,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 2,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 3,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 4,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 5,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 6,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 7,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 8,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 9,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
            ]
        }
    }
}
</script>
<style 
    lang="scss" 
    scoped
    src="./messages.scss">
</style>