<template>
    <div class="messages">
        <div class="messages__content">
            <div class="messages__date">
                <datetime 
                    type="datetime" 
                    zone="UTC+6" 
                    input-class="input-date" 
                    placeholder="Выберите дату"
                    v-model="date">
                </datetime>
            </div>
            <div class="messages__text">
                <editor-menu-bar 
                    :editor="editor" 
                    v-slot="{ commands, isActive }">
                    <div class="menu-bar">
                        <button 
                            :class="{ 'is-active': isActive.bold() }" 
                            class="menu-item"
                            @click="commands.bold">
                            Bold
                        </button>
                        <button 
                            :class="{ 'is-active': isActive.italic() }" 
                            class="menu-item"
                            @click="commands.italic">
                            Italic
                        </button>
                        <button 
                            :class="{ 'is-active': isActive.strike() }" 
                            class="menu-item"
                            @click="commands.strike">
                            Strike
                        </button>
                    </div>
                </editor-menu-bar>
                <editor-content 
                    :editor="editor" 
                    class="messages__editor"/>
                <div class="messages__text__actions">
                    <button @click="sendMessage">Отправить</button>
                    <button @click="setMessage">Создать</button>
                </div>
            </div>
            <div class="messages__container">
                <div class="messages__items">
                    <div 
                        class="messages__item"
                        v-for="item in messages"
                        :key="item.id">
                        <div class="messages__item__actions">
                            <div class="messages__item__date">
                                <span>Сообщение будет отправлено:</span>
                                <b>{{item.date}}</b>
                            </div>
                            <div class="messages__item__action">
                                <v-actions></v-actions>
                            </div>
                        </div>
                        <div class="messages__item__data">
                            {{item.message}}
                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>
<script>
import { Editor, EditorContent, EditorMenuBar  } from 'tiptap'
import {  Bold, Italic, Strike } from 'tiptap-extensions'
export default {
    components: {
        EditorContent,
        EditorMenuBar,
    },
    data(){
        return{
            date: '',
            editor: null,
            message: '',
            messages: [
                {
                    id: 1,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 2,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 3,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 4,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 5,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 6,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 7,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 8,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
                {
                    id: 9,
                    date: '22. 08. 2019 12:05:30',
                    message: 'Сайт рыбатекст поможет дизайнеру, верстальщику, вебмастеру сгенерировать несколько абзацев более менее осмысленного текста рыбы на русском языке, а начинающему оратору отточить навык публичных выступлений в домашних условиях. При создании генератора мы использовали небезизвестный универсальный код речей'
                },
            ]
        }
    },
    mounted(){
        this.editor = new Editor({
            content: '',
            extensions: [
                new Bold(),
                new Italic(),
                new Strike(),
            ],
            onUpdate: ({ getHTML }) => {
                this.message = getHTML();
            }
        })
    },
    beforeDestroy() {
        this.editor.destroy();
    },
    methods: {
        sendMessage(){
            console.log(this.message);
        },
        setMessage(){
            this.editor.setContent('<p>This is <strong>some</strong> inserted text. 👋</p>')
        }
    }
}
</script>
<style 
    lang="scss" 
    scoped
    src="./messages.scss">
</style>